Revit 2024 API
WireframeBuilder Methods
The WireframeBuilder type exposes the following members.
Methods
Name | Description
AddCurve
 Add a curve to the shape representation stored in this WireframeBuilder.
AddPoint
 Add a point to the shape representation stored in this WireframeBuilder.
Dispose |  (Inherited from ShapeBuilder.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Reset
 Clears the accumulated geometry.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
ValidateCurve
 Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
ValidatePoint
 Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.
See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace